#ifndef APPCONSTANTS_H
#define APPCONSTANTS_H

// 应用程序常量定义
namespace AppConstants {
    // 最大网格等级
const int MAX_ZOOM_LEVEL = 21; // 最大层级改为18
const int PRE_GENERATED_MAX_LEVEL = 10; // 预生成的最大层级

    // 天地图比例尺分母数组（对应层级1-18）
    const double TDT_SCALE_DENOMINATORS[] = {
        2.958293554545656E8,   // 层级1
        1.479146777272828E8,   // 层级2
        7.39573388636414E7,    // 层级3
        3.69786694318207E7,    // 层级4
        1.848933471591035E7,   // 层级5
        9244667.357955175,     // 层级6
        4622333.678977588,     // 层级7
        2311166.839488794,     // 层级8
        1155583.419744397,     // 层级9
        577791.7098721985,     // 层级10
        288895.85493609926,    // 层级11
        144447.92746804963,    // 层级12
        72223.96373402482,     // 层级13
        36111.98186701241,     // 层级14
        18055.990933506204,    // 层级15
        9027.995466753102,     // 层级16
        4513.997733376551,     // 层级17
        2256.998866688275,     // 层级18
        1128.499433344138,    // 层级19
        564.249716672069,      // 层级20
        282.1248583360345,     // 层级21
        //141.0624291680173      // 层级22

        // 层级18
    };
}

#endif // APPCONSTANTS_H
